const arr0 = [
  [
    "State",
    "Under 5 Years",
    "5 to 13 Years",
    "14 to 17 Years",
    "18 to 24 Years",
    "25 to 44 Years",
    "45 to 64 Years",
    "65 Years and Over"
  ],
  [
    "CA",
    "2704659",
    "4499890",
    "2159981",
    "3853788",
    "10604510",
    "8819342",
    "4114496"
  ],
  [
    "TX",
    "2027307",
    "3277946",
    "1420518",
    "2454721",
    "7017731",
    "5656528",
    "2472223"
  ],
  [
    "NY",
    "1208495",
    "2141490",
    "1058031",
    "1999120",
    "5355235",
    "5120254",
    "2607672"
  ],
  [
    "FL",
    "1140516",
    "1938695",
    "925060",
    "1607297",
    "4782119",
    "4746856",
    "3187797"
  ],
  [
    "IL",
    "894368",
    "1558919",
    "725973",
    "1311479",
    "3596343",
    "3239173",
    "1575308"
  ],
  [
    "PA",
    "737462",
    "1345341",
    "679201",
    "1203944",
    "3157759",
    "3414001",
    "1910571"
  ]
];

const arr1 = [
  ["", "삼성", "SK"],
  ["2014년", "28.4", "10.0"],
  ["2015년", "30.8", "11.8"],
  ["2016년", "36.1", "10.2"],
  ["2017년", "38.3", "10.7"]
];

// const csv0 = `"State","Under 5 Years","5 to 13 Years","14 to 17 Years","18 to 24 Years","25 to 44 Years","45 to 64 Years","65 Years and Over"
// "CA","2704659","4499890","2159981","3853788","10604510","8819342","4114496"
// "TX","2027307","3277946","1420518","2454721","7017731","5656528","2472223"
// "NY","1208495","2141490","1058031","1999120","5355235","5120254","2607672"
// "FL","1140516","1938695","925060","1607297","4782119","4746856","3187797"
// "IL","894368","1558919","725973","1311479","3596343","3239173","1575308"
// "PA","737462","1345341","679201","1203944","3157759","3414001","1910571"`;

// const csv0 = `State,Under 5 Years,5 to 13 Years,14 to 17 Years,18 to 24 Years,25 to 44 Years,45 to 64 Years,65 Years and Over
// CA,2704659,4499890,2159981,3853788,10604510,8819342,4114496
// TX,2027307,3277946,1420518,2454721,7017731,5656528,2472223
// NY,1208495,2141490,1058031,1999120,5355235,5120254,2607672
// FL,1140516,1938695,925060,1607297,4782119,4746856,3187797
// IL,894368,1558919,725973,1311479,3596343,3239173,1575308
// PA,737462,1345341,679201,1203944,3157759,3414001,1910571`;

// const csv1 = `,삼성,SK
// 2014년,28.4,10.0
// 2015년,30.8,11.8
// 2016년,36.1,10.2
// 2017년,38.3,10.7`;

// const csv2 = `단지명,전용면적,상승가격,상승률
// 은평아파트,54.43,2천만원,108.2
// 혼마아파트,82.5,1천3백만원,111.42
// 현대아파트,53.06,3천만원,118.3
// 롯데아파트,73.5,1억원,104.3
// `;

const id = 5;
// const graph_colors = [
//   "#499fc9",
//   "#4a67c6",
//   "#af4390",
//   "#5d9ec6",
//   "#43acaf",
//   "#594ac6",
//   "#8544aa",
//   "#4ac6ae"
// ];

const DARK = {
  colorPrimary: "#ffffff",
  colorSecondary: "#d9dadb",
  colorTernary: "#ffffff",
  backgroundColor: "#2c2d2e",
  colorStripe1: "#333435",
  colorStripe2: "#2c2d2e",
  colorAxis: "#6d6d6d"
};
const LIGHT = {
  colorPrimary: "#000000",
  colorSecondary: "#4B4949",
  colorTernary: "#7f7f7f",
  backgroundColor: "#f3f4f5",
  colorStripe1: "#e6e7e8",
  colorStripe2: "#f3f4f5",
  colorAxis: "#6d6d6d"
};
const theme = LIGHT;

const label = [
  {
    row: 1,
    col: 1,
    comment: "hi (28.4)"
  },
  {
    row: 2,
    col: 2,
    comment: "hi2"
  }
];

export const gcht0 = {
  id,
  label,
  theme,
  // graph_colors,
  rawData: arr0,
  title: "주요 금융그룹 충당금",
  subtitle: "부제는 여기에 위치합니다",
  reference: "통계청",
  madeBy: "강선미 기자",
  unit: "백만원"
};

export const gcht1 = {
  id,
  label,
  theme,
  // graph_colors,
  rawData: arr1,
  title: "주요 금융그룹 충당금",
  subtitle: "부제는 여기에 위치합니다",
  reference: "통계청",
  madeBy: "강선미 기자",
  unit: "백만원"
};
